; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=57, out_folder=htg/blocksworld/training, instance_id=37, seed=2061, goal_proportion=0.1

(define (problem blocksworld-37)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 - object)
 (:init 
    (arm-empty)
    (clear b49)
    (on b49 b30)
    (on b30 b9)
    (on b9 b34)
    (on b34 b23)
    (on b23 b46)
    (on-table b46)
    (clear b12)
    (on b12 b56)
    (on b56 b6)
    (on b6 b55)
    (on b55 b37)
    (on-table b37)
    (clear b39)
    (on b39 b38)
    (on b38 b35)
    (on b35 b22)
    (on b22 b43)
    (on b43 b47)
    (on b47 b3)
    (on b3 b29)
    (on b29 b42)
    (on b42 b36)
    (on-table b36)
    (clear b32)
    (on b32 b52)
    (on b52 b2)
    (on b2 b45)
    (on b45 b17)
    (on-table b17)
    (clear b25)
    (on b25 b33)
    (on b33 b10)
    (on b10 b7)
    (on b7 b11)
    (on b11 b13)
    (on b13 b20)
    (on b20 b15)
    (on b15 b57)
    (on b57 b28)
    (on b28 b4)
    (on b4 b1)
    (on b1 b18)
    (on b18 b16)
    (on b16 b44)
    (on-table b44)
    (clear b26)
    (on b26 b51)
    (on b51 b14)
    (on b14 b54)
    (on b54 b53)
    (on b53 b27)
    (on b27 b48)
    (on b48 b50)
    (on b50 b40)
    (on b40 b5)
    (on b5 b21)
    (on b21 b8)
    (on b8 b31)
    (on b31 b19)
    (on b19 b41)
    (on b41 b24)
    (on-table b24))
 (:goal  (and 
    (clear b5)
    (on-table b5)
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b39 b38)
   deleted: (on b39 b38) (clear b39) (arm-empty)
   added: (holding b39) (clear b38)
   goals met: 0 of 8
2. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 0 of 8
3. (unstack b38 b35)
   deleted: (on b38 b35) (clear b38) (arm-empty)
   added: (holding b38) (clear b35)
   goals met: 0 of 8
4. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 8
5. (unstack b35 b22)
   deleted: (on b35 b22) (clear b35) (arm-empty)
   added: (holding b35) (clear b22)
   goals met: 0 of 8
6. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 0 of 8
7. (unstack b22 b43)
   deleted: (on b22 b43) (clear b22) (arm-empty)
   added: (holding b22) (clear b43)
   goals met: 0 of 8
8. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 8
9. (unstack b43 b47)
   deleted: (on b43 b47) (clear b43) (arm-empty)
   added: (holding b43) (clear b47)
   goals met: 0 of 8
10. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 0 of 8
11. (unstack b47 b3)
   deleted: (on b47 b3) (clear b47) (arm-empty)
   added: (holding b47) (clear b3)
   goals met: 0 of 8
12. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 0 of 8
13. (unstack b3 b29)
   deleted: (on b3 b29) (clear b3) (arm-empty)
   added: (holding b3) (clear b29)
   goals met: 0 of 8
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 8
15. (unstack b32 b52)
   deleted: (on b32 b52) (clear b32) (arm-empty)
   added: (holding b32) (clear b52)
   goals met: 1 of 8
16. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 1 of 8
17. (unstack b52 b2)
   deleted: (on b52 b2) (clear b52) (arm-empty)
   added: (holding b52) (clear b2)
   goals met: 1 of 8
18. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 1 of 8
19. (unstack b2 b45)
   deleted: (on b2 b45) (clear b2) (arm-empty)
   added: (holding b2) (clear b45)
   goals met: 1 of 8
20. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 2 of 8
21. (unstack b25 b33)
   deleted: (on b25 b33) (clear b25) (arm-empty)
   added: (holding b25) (clear b33)
   goals met: 2 of 8
22. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 8
23. (unstack b26 b51)
   deleted: (on b26 b51) (clear b26) (arm-empty)
   added: (holding b26) (clear b51)
   goals met: 2 of 8
24. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 8
25. (unstack b51 b14)
   deleted: (on b51 b14) (clear b51) (arm-empty)
   added: (holding b51) (clear b14)
   goals met: 2 of 8
26. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 2 of 8
27. (unstack b14 b54)
   deleted: (on b14 b54) (clear b14) (arm-empty)
   added: (holding b14) (clear b54)
   goals met: 2 of 8
28. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 8
29. (unstack b54 b53)
   deleted: (on b54 b53) (clear b54) (arm-empty)
   added: (holding b54) (clear b53)
   goals met: 2 of 8
30. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 2 of 8
31. (unstack b53 b27)
   deleted: (on b53 b27) (clear b53) (arm-empty)
   added: (holding b53) (clear b27)
   goals met: 2 of 8
32. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 8
33. (unstack b27 b48)
   deleted: (on b27 b48) (clear b27) (arm-empty)
   added: (holding b27) (clear b48)
   goals met: 2 of 8
34. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 8
35. (unstack b48 b50)
   deleted: (on b48 b50) (clear b48) (arm-empty)
   added: (holding b48) (clear b50)
   goals met: 2 of 8
36. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 2 of 8
37. (unstack b50 b40)
   deleted: (on b50 b40) (clear b50) (arm-empty)
   added: (holding b50) (clear b40)
   goals met: 2 of 8
38. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 2 of 8
39. (unstack b40 b5)
   deleted: (on b40 b5) (clear b40) (arm-empty)
   added: (holding b40) (clear b5)
   goals met: 3 of 8
40. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 8
41. (unstack b5 b21)
   deleted: (on b5 b21) (clear b5) (arm-empty)
   added: (holding b5) (clear b21)
   goals met: 2 of 8
42. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 8
43. (unstack b33 b10)
   deleted: (on b33 b10) (clear b33) (arm-empty)
   added: (holding b33) (clear b10)
   goals met: 4 of 8
44. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 4 of 8
45. (unstack b10 b7)
   deleted: (on b10 b7) (clear b10) (arm-empty)
   added: (holding b10) (clear b7)
   goals met: 4 of 8
46. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 4 of 8
47. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 4 of 8
48. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 8
49. (unstack b11 b13)
   deleted: (on b11 b13) (clear b11) (arm-empty)
   added: (holding b11) (clear b13)
   goals met: 4 of 8
50. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 8
51. (unstack b13 b20)
   deleted: (on b13 b20) (clear b13) (arm-empty)
   added: (holding b13) (clear b20)
   goals met: 4 of 8
52. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 8
53. (unstack b20 b15)
   deleted: (on b20 b15) (clear b20) (arm-empty)
   added: (holding b20) (clear b15)
   goals met: 4 of 8
54. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 8
55. (unstack b15 b57)
   deleted: (on b15 b57) (clear b15) (arm-empty)
   added: (holding b15) (clear b57)
   goals met: 4 of 8
56. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 8
57. (unstack b57 b28)
   deleted: (on b57 b28) (clear b57) (arm-empty)
   added: (holding b57) (clear b28)
   goals met: 4 of 8
58. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 4 of 8
59. (unstack b28 b4)
   deleted: (on b28 b4) (clear b28) (arm-empty)
   added: (holding b28) (clear b4)
   goals met: 5 of 8
60. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 5 of 8
61. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 5 of 8
62. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 8
63. (unstack b1 b18)
   deleted: (on b1 b18) (clear b1) (arm-empty)
   added: (holding b1) (clear b18)
   goals met: 6 of 8
64. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 8
